stress-test/efs-io-benchmark/run.out
[2026-04-16 14:03:57 UTC] === EFS fio Benchmark v2 ===
[2026-04-16 14:03:57 UTC] === Phase 1: gVisor ===
namespace/efs-fio-gvisor created
persistentvolumeclaim/efs-fio created
pod/fio created
[2026-04-16 14:03:58 UTC] Waiting PVC bind...
[2026-04-16 14:03:58 UTC] Waiting pod Ready (up to 300s)...
pod/fio condition met
[2026-04-16 14:04:16 UTC] Waiting for fio install...
[2026-04-16 14:04:32 UTC] fio installed, ready to test.
[2026-04-16 14:04:32 UTC] [gvisor] seq-write: rw=write bs=1M iodepth=32 numjobs=4 runtime=60s
[2026-04-16 14:04:33 UTC] [gvisor] seq-write: fio output parse failed, raw output:
        "1000" : 0.000000
      },
      "latency_ms" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000,
        "2000" : 0.000000,
        ">=2000" : 0.000000
      }
    }
  ]
}
command terminated with exit code 4
[2026-04-16 14:04:37 UTC] [gvisor] seq-read: rw=read bs=1M iodepth=32 numjobs=4 runtime=60s
[2026-04-16 14:04:37 UTC] [gvisor] Pre-creating 1G test file...
pre: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=psync, iodepth=1
fio-3.28
Starting 1 process
pre: Laying out IO file (1 file / 1024MiB)


Run status group 0 (all jobs):
command terminated with exit code 1
[2026-04-16 14:04:41 UTC] [gvisor] seq-read: fio output parse failed, raw output:
        "1000" : 0.000000
      },
      "latency_ms" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000,
        "2000" : 0.000000,
        ">=2000" : 0.000000
      }
    }
  ]
}
command terminated with exit code 4
[2026-04-16 14:04:45 UTC] [gvisor] rand-write: rw=randwrite bs=4k iodepth=32 numjobs=4 runtime=60s
[2026-04-16 14:04:46 UTC] [gvisor] rand-write: fio output parse failed, raw output:
        "1000" : 0.000000
      },
      "latency_ms" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000,
        "2000" : 0.000000,
        ">=2000" : 0.000000
      }
    }
  ]
}
command terminated with exit code 4
[2026-04-16 14:04:49 UTC] [gvisor] rand-read: rw=randread bs=4k iodepth=32 numjobs=4 runtime=60s
[2026-04-16 14:04:49 UTC] [gvisor] Pre-creating 1G test file...
pre: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=psync, iodepth=1
fio-3.28
Starting 1 process
pre: Laying out IO file (1 file / 1024MiB)


Run status group 0 (all jobs):
command terminated with exit code 1
[2026-04-16 14:04:54 UTC] [gvisor] rand-read: fio output parse failed, raw output:
        "1000" : 0.000000
      },
      "latency_ms" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000,
        "2000" : 0.000000,
        ">=2000" : 0.000000
      }
    }
  ]
}
command terminated with exit code 4
namespace "efs-fio-gvisor" force deleted
[2026-04-16 14:05:22 UTC] === Phase 2: runc ===
namespace/efs-fio-runc created
persistentvolumeclaim/efs-fio created
pod/fio created
[2026-04-16 14:05:24 UTC] Waiting PVC bind...
[2026-04-16 14:05:24 UTC] Waiting pod Ready (up to 300s)...
pod/fio condition met
[2026-04-16 14:05:37 UTC] Waiting for fio install...
[2026-04-16 14:05:54 UTC] fio installed, ready to test.
[2026-04-16 14:05:54 UTC] [runc] seq-write: rw=write bs=1M iodepth=32 numjobs=4 runtime=60s
[2026-04-16 14:06:55 UTC] [runc] seq-write: BW=1697.35 MiB/s  IOPS=1697  lat_avg=2340.9us  lat_p99=23724.0us
[2026-04-16 14:06:59 UTC] [runc] seq-read: rw=read bs=1M iodepth=32 numjobs=4 runtime=60s
[2026-04-16 14:06:59 UTC] [runc] Pre-creating 1G test file...
pre: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=psync, iodepth=1
fio-3.28
Starting 1 process
pre: Laying out IO file (1 file / 1024MiB)

pre: (groupid=0, jobs=1): err= 0: pid=728: Thu Apr 16 14:07:01 2026
  write: IOPS=619, BW=619MiB/s (650MB/s)(1024MiB/1653msec); 0 zone resets
    clat (usec): min=59, max=120, avg=66.39, stdev= 3.73
     lat (usec): min=67, max=133, avg=74.70, stdev= 4.34
    clat percentiles (usec):
     |  1.00th=[   62],  5.00th=[   64], 10.00th=[   64], 20.00th=[   65],
     | 30.00th=[   65], 40.00th=[   66], 50.00th=[   67], 60.00th=[   67],
     | 70.00th=[   68], 80.00th=[   69], 90.00th=[   70], 95.00th=[   72],
     | 99.00th=[   81], 99.50th=[   89], 99.90th=[   95], 99.95th=[  121],
     | 99.99th=[  121]
  lat (usec)   : 100=99.90%, 250=0.10%
  cpu          : usr=1.21%, sys=3.75%, ctx=140, majf=0, minf=8
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1024,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=619MiB/s (650MB/s), 619MiB/s-619MiB/s (650MB/s-650MB/s), io=1024MiB (1074MB), run=1653-1653msec
[2026-04-16 14:08:05 UTC] [runc] seq-read: BW=3649.82 MiB/s  IOPS=3650  lat_avg=1074.9us  lat_p99=20840.4us
[2026-04-16 14:08:09 UTC] [runc] rand-write: rw=randwrite bs=4k iodepth=32 numjobs=4 runtime=60s
[2026-04-16 14:09:23 UTC] [runc] rand-write: BW=249.61 MiB/s  IOPS=63902  lat_avg=49.9us  lat_p99=10.5us
[2026-04-16 14:09:27 UTC] [runc] rand-read: rw=randread bs=4k iodepth=32 numjobs=4 runtime=60s
[2026-04-16 14:09:27 UTC] [runc] Pre-creating 1G test file...
pre: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=psync, iodepth=1
fio-3.28
Starting 1 process
pre: Laying out IO file (1 file / 1024MiB)

pre: (groupid=0, jobs=1): err= 0: pid=773: Thu Apr 16 14:09:29 2026
  write: IOPS=628, BW=628MiB/s (659MB/s)(1024MiB/1630msec); 0 zone resets
    clat (usec): min=61, max=109, avg=67.51, stdev= 3.40
     lat (usec): min=68, max=120, avg=75.43, stdev= 3.71
    clat percentiles (usec):
     |  1.00th=[   63],  5.00th=[   64], 10.00th=[   65], 20.00th=[   66],
     | 30.00th=[   67], 40.00th=[   67], 50.00th=[   68], 60.00th=[   69],
     | 70.00th=[   69], 80.00th=[   70], 90.00th=[   71], 95.00th=[   73],
     | 99.00th=[   81], 99.50th=[   86], 99.90th=[   94], 99.95th=[  111],
     | 99.99th=[  111]
  lat (usec)   : 100=99.90%, 250=0.10%
  cpu          : usr=0.61%, sys=4.42%, ctx=130, majf=0, minf=8
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1024,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=628MiB/s (659MB/s), 628MiB/s-628MiB/s (659MB/s-659MB/s), io=1024MiB (1074MB), run=1630-1630msec
[2026-04-16 14:10:32 UTC] [runc] rand-read: BW=10.81 MiB/s  IOPS=2768  lat_avg=1444.1us  lat_p99=4489.2us
[2026-04-16 14:10:36 UTC] === All done ===
runtime,test,rw,bs,bw_kib,bw_mib,iops,lat_avg_us,lat_p99_us
gvisor,seq-write,write,1M,0,0,0,0,0
gvisor,seq-read,read,1M,0,0,0,0,0
gvisor,rand-write,randwrite,4k,0,0,0,0,0
gvisor,rand-read,randread,4k,0,0,0,0,0
runc,seq-write,write,1M,1738095,1697.35,1697,2340.9,23724.0
runc,seq-read,read,1M,3737424,3649.82,3650,1074.9,20840.4
runc,rand-write,randwrite,4k,255609,249.61,63902,49.9,10.5
runc,rand-read,randread,4k,11070,10.81,2768,1444.1,4489.2
namespace "efs-fio-runc" force deleted